trade_exp/src/Documents/Пропуск/Пропуск.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="40c6e6cf-b72f-4a58-bb30-ef44407a6c36">
  <name>Пропуск</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="caf247e2-4077-447f-b4fc-57f2b91b3323">
    <name>Доступ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="12cf2cfc-6806-4e64-a645-8eae5aba9e37">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ba331897-fef1-466b-a64b-e88432d8bfed">
    <name>ТипПропуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c82a20e8-4ecc-4edf-9443-2a129787f88d">
    <name>ЦельПосещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e07e4292-e551-4bc1-881d-20c85b4b9130">
    <name>Расшифровка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0737fcab-2209-423b-9ac2-108aeaf19802">
    <name>ФИО</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="27a561ad-aa27-442d-be21-2caf93c2a208">
    <name>ВидТранспортногоСредства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b8b8bab6-8256-4375-8149-d48184352abe">
    <name>НаименованиеОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="37f0c450-580f-4ac0-95ae-d5b9d95155fa">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="44dd51fe-efa5-42f6-8f36-d29ec59c7464">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0562081-ea83-4c76-b366-04c8aa0d79a0">
    <name>ТипПрохода</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3d7be871-19e4-4d23-bedb-1c53b2a1a08f">
    <name>ТребуетсяПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6abb30b9-96c0-4f1e-904d-30130b54f3fa">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d61bf324-c1d8-45b2-9921-23411a373306">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5f37c12d-794f-4909-8515-13506af8c440">
    <name>Прекращен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3789b914-6a24-4b5d-935e-9a5357ce0cef">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9247de40-43c3-41a1-b013-2d5a9c7c42fd">
    <name>РазрешеноУстанавливатьПериодНеПозднее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d900407b-bf13-4559-9b94-d77a215eb1b3">
    <name>QRкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Document>

trade_exp/src/Catalogs/Отделы/Отделы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="185e8ada-3ead-4fe0-ba9f-7aa6f38fdec9">
  <name>Отделы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="11e387f3-54db-4496-ad7b-06da8f792e73">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4f190465-8417-419b-8aba-b08c44f1381c">
    <name>ГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a83eb5ec-5c8c-4666-ab48-1906e7d68823">
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="29965ef5-fb06-4b3d-9add-ecdd687031a0">
    <name>ИзменятьПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f5f9d143-4a06-49e2-bb8d-855ab3318513">
    <name>ИзменятьТипПропуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c8de732e-42ad-4635-a3a9-c2528b778cad">
    <name>УровеньДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9344b6ff-f02a-4c5b-ad60-a91807edf87e">
    <name>ЗапретитьСоздаватьПропуск</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="df94b4fc-8646-43ca-b344-fb1a1ce8f0f2">
    <name>ЦельПоУмолчанию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="388216eb-779b-43cf-af83-f29c6389729f">
    <name>ИзменятьЦель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7181374d-e109-40a4-abc7-b447da5d30f4">
    <name>ИзменятьТребуетПодтверждение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="662ddfb0-40cb-4323-9382-c3a57c6241b1">
    <name>УстанавливатьПериодНеПозднее</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3fb68ed7-b552-4957-a4a7-308c80a4b197">
    <name>ИдентификаторАстерикс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eaff3ee1-6abe-4021-b5fe-b1484b94e6d0">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="da752511-61de-4f01-a166-216839c92e11">
    <name>ВнутреннийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9f6d87ce-cb27-41e1-a72f-e5290739fc24">
    <name>КорпоративныйТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="4c64d903-4c47-4645-aa2a-dc29f8918424">
    <name>СписокЗон</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="1111ed8c-d901-4d0e-8970-a72ac74d223d">
      <name>ЗонаДоступа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Documents/Пропуск/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначенияЗаполнения.Свойство("ЦельПосещения") Тогда
		УстановитьВидимостьПриСозданииИзРабочегоМестаОпрератораКПП(Параметры.ЗначенияЗаполнения.ЦельПосещения);
	КонецЕсли;
	
	ПараметрыИзСправочникаСотрудники = ПолучитьПараметрыИзСправочникаСотрудники(Объект.Автор); 
	
	Если ПараметрыИзСправочникаСотрудники.Количество() = 0 Тогда 
		Сообщить("Не найден сотрудник");
		Отказ = Истина;
		Возврат;
	Иначе
		ПараметрыСотрудника = ПараметрыИзСправочникаСотрудники[0];

	КонецЕсли;
	
	УстановитьДоступность(ПараметрыСотрудника);
	УстановитьОграниченияВыбораЗоныДоступа(ПараметрыСотрудника.СписокЗон);
	
	Если Параметры.Ключ.Пустая() Тогда
		Если ПараметрыСотрудника.ЗапретитьСоздаватьПропуск = Истина И НЕ РольДоступна("ПолныеПрава") Тогда	
			Сообщить("Запрещено создавать пропуск");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	КорректировкаДатыОкончанияПропуска(Дата(Элемент.ТекстРедактирования));	
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);

	ОбщегоНазначенияУТКлиент.РедактироватьПериод(Объект, 
		Новый Структура("ДатаНачала, ДатаОкончания", "ДатаНачала", "ДатаОкончания"), Оповещение);
		
КонецПроцедуры

&НаКлиенте
Процедура НапечататьПропуск(Команда)
	
	Если НЕ(ЗначениеЗаполнено(Объект.ФИО) ИЛИ ЗначениеЗаполнено(Объект.ВидТранспортногоСредства) ИЛИ ЗначениеЗаполнено(Объект.НаименованиеОрганизации)) Тогда
		Сообщить("Не заполнены данные лица");
		Возврат;
	КонецЕсли;

	ПровестиДокумент();
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Документ.Пропуск",
			"ПропускЭтикетка",
			Объект.Ссылка,
			Неопределено,
			Неопределено);

	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура КорректировкаДатыОкончанияПропуска(ВыбраннаяДата)
	
	Если Объект.РазрешеноУстанавливатьПериодНеПозднее > 0 Тогда
		МакРазрешеннаяДата = Объект.ДатаНачала + 86400 * Объект.РазрешеноУстанавливатьПериодНеПозднее;
		Если МакРазрешеннаяДата <> ТекущаяДата() И МакРазрешеннаяДата < ВыбраннаяДата Тогда
			 Объект.ДатаОкончания = МакРазрешеннаяДата;
			 Сообщить("Действует ограничение выбора даты, максимальная разрешенная дата " + МакРазрешеннаяДата);
		 КонецЕсли;	
	 КонецЕсли;
	 
	Если Объект.ДатаОкончания <> Дата(1,1,1) И Час(Объект.ДатаОкончания) = 0 И Минута(Объект.ДатаОкончания) = 0 И Секунда(Объект.ДатаОкончания) = 0 Тогда
		Объект.ДатаОкончания = Дата(Год(Объект.ДатаОкончания), Месяц(Объект.ДатаОкончания), День(Объект.ДатаОкончания), 22, 0, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(Результат, ДопПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
		КорректировкаДатыОкончанияПропуска(Результат.ДатаОкончания);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПровестиДокумент()
	ПараметрЗаписи =  Новый Структура;
	ПараметрЗаписи.Вставить("РежимЗаписи",РежимЗаписиДокумента.Проведение);
	ЭтаФорма.Записать(ПараметрЗаписи);
	
	//Добавляем QR-код 
	Объект.QRкод = ГенерацияШтрихкода.СформироватьQRКод(Объект.Ссылка);
	ЭтаФорма.Записать(ПараметрЗаписи);
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность(ПараметрыСотрудника)
	
	Элементы.Подразделение.Доступность = ПараметрыСотрудника.ИзменятьПодразделение;
	Элементы.ТипПропуска.Доступность = ПараметрыСотрудника.ИзменятьТипПропуска;     
	Элементы.ЦельПосещения.Доступность = ПараметрыСотрудника.ИзменятьЦель;
	Элементы.ТребуетсяПодтверждение.Доступность = ПараметрыСотрудника.ИзменятьТребуетПодтверждение;

КонецПроцедуры

&НаСервере
Процедура УстановитьОграниченияВыбораЗоныДоступа(СписокЗонДоступаСотрудника)
	
	мПараметрыВыбора = Новый Массив();
 
	Если СписокЗонДоступаСотрудника.Количество() > 0 Тогда	
		мДоступныеЗоны = Новый Массив();
		
		Для Каждого Стр Из СписокЗонДоступаСотрудника Цикл
			мДоступныеЗоны.Добавить(Стр.ЗонаДоступа);
		КонецЦикла;
		
		Параметр = Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(мДоступныеЗоны));		
		мПараметрыВыбора.Добавить(Параметр);
		ЭтаФорма.Элементы.Доступ.ПараметрыВыбора = Новый ФиксированныйМассив(мПараметрыВыбора);			


	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьПриСозданииИзРабочегоМестаОпрератораКПП(ЦельПосещения)
	
	Элементы.ГруппаОбщее.Видимость = Ложь;
	Если ЦельПосещения = Справочники.ЦелиПосещения.ВывозМусора ИЛИ ЦельПосещения = Справочники.ЦелиПосещения.Аутсорс ИЛИ ЦельПосещения = Справочники.ЦелиПосещения.Собеседование Тогда
		Элементы.НаименованиеОрганизации.Видимость = Ложь;
	КонецЕсли;
	Если ЦельПосещения = Справочники.ЦелиПосещения.Аутсорс ИЛИ ЦельПосещения = Справочники.ЦелиПосещения.Собеседование Тогда  
		Элементы.ВидТранспортногоСредства.Видимость = Ложь;
	КонецЕсли;
	Элементы.ГруппаКомментарий.Видимость = Ложь;
	Элементы.ФормаКоманднаяПанель.Видимость = Ложь;
	Элементы.НапечататьПропуск.Видимость = Истина;
	
	Если ЦельПосещения = Справочники.ЦелиПосещения.КлиентПрочее Тогда 
		ЗаголовокБыстрогоПропуска = "Клиент";
	Иначе
		ЗаголовокБыстрогоПропуска = ЦельПосещения;
	КонецЕсли;	
	Элементы.НазваниеБыстрогоПропуска.Заголовок = ЗаголовокБыстрогоПропуска;
	Элементы.НазваниеБыстрогоПропуска.Видимость = Истина;

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыИзСправочникаСотрудники(Пользователь) Экспорт
	
	Сотрудник = АльтерраОбщегоНазначения.ПолучитьСотрудника(Пользователь);
	
	Запрос = Новый Запрос;
	Если Сотрудник.Индивидуально Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.ЗапретитьСоздаватьПропуск КАК ЗапретитьСоздаватьПропуск,
		|	Сотрудники.ИзменятьПодразделение КАК ИзменятьПодразделение,
		|	Сотрудники.ИзменятьТипПропуска КАК ИзменятьТипПропуска,
		|	Сотрудники.ИзменятьЦель КАК ИзменятьЦель,
		|	Сотрудники.ИзменятьТребуетПодтверждение КАК ИзменятьТребуетПодтверждение,
		|	Сотрудники.СписокЗон.(
		|		Ссылка КАК Ссылка,
		|		ЗонаДоступа КАК ЗонаДоступа
		|	) КАК СписокЗон
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник";
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Иначе 
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Отделы.ЗапретитьСоздаватьПропуск КАК ЗапретитьСоздаватьПропуск,
		|	Отделы.ИзменятьПодразделение КАК ИзменятьПодразделение,
		|	Отделы.ИзменятьТипПропуска КАК ИзменятьТипПропуска,
		|	Отделы.ИзменятьЦель КАК ИзменятьЦель,
		|	Отделы.ИзменятьТребуетПодтверждение КАК ИзменятьТребуетПодтверждение,
		|	Отделы.СписокЗон.(
		|		Ссылка КАК Ссылка,
		|		ЗонаДоступа КАК ЗонаДоступа
		|	) КАК СписокЗон
		|ИЗ
		|	Справочник.Отделы КАК Отделы
		|ГДЕ
		|	Отделы.Ссылка = &Отдел";
		Запрос.УстановитьПараметр("Отдел", Сотрудник.Отдел);
	КонецЕсли;
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И 
		НЕ(ЗначениеЗаполнено(Объект.ФИО) ИЛИ ЗначениеЗаполнено(Объект.ВидТранспортногоСредства) ИЛИ ЗначениеЗаполнено(Объект.НаименованиеОрганизации)) Тогда
			Сообщить("Не заполнены данные лица");
			Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		ПровестиДокумент();
КонецПроцедуры 
	


#КонецОбласти
